In [4]:
import selenium 
import pandas as pd
from selenium import webdriver 
import warnings 
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By 
import time

In [173]:
driver = webdriver.Chrome()

In [5]:
driver.get("https://www.naukri.com/")

In [6]:
#maximize window 
driver.maximize_window()

In [7]:
designation=driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation.send_keys('Data Scientist')

In [8]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[7]/div/div/div[5]/div/div/div/div[1]/div/input")
location.send_keys('Delhi/NCR')

In [9]:
driver.maximize_window()

In [10]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [17]:
search=driver.find_element(By.XPATH,"//div[@class='styles_filterContainer__4aQaD'][4]/div[2]/div[2]/label/p/span[1]")
search.click()

In [30]:
job_titles=[]
job_location=[]
company_name=[]
experience_required=[]

In [31]:
title_tags=driver.find_elements(By.XPATH,"//div[@class='cust-job-tuple layout-wrapper lay-2 sjw__tuple ']/div/a")
for i in title_tags:
    title=i.text
    job_titles.append(title)

In [33]:
len(job_titles)

19

In [34]:
location_tags=driver.find_elements(By.XPATH,'//span[@class="locWdth"]')
for i in location_tags:
    location=i.text
    job_location.append(location)

In [38]:
len(job_location)

19

In [50]:
print(job_location)

['Gurugram', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Noida', 'Noida', 'Gurugram', 'Gurugram', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Gurugram, Bengaluru', 'Gurugram', 'New Delhi', 'Gurugram', 'Noida', 'Mumbai, Gurugram', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Gurugram']

In [40]:
company_tags=driver.find_elements(By.XPATH,"//div[@class='cust-job-tuple layout-wrapper lay-2 sjw__tuple ']/div[2]/span/a[1]")
for i in company_tags:
    company=i.text
    company_name.append(company)

In [41]:
len(company_name)

19

In [42]:
experience_tags=driver.find_elements(By.XPATH,"//div[@class='cust-job-tuple layout-wrapper lay-2 sjw__tuple ']/div[3]/div/span[1]/span/span")
for i in experience_tags:
    exp=i.text
    experience_required.append(exp)

In [43]:
len(experience_required)

19

In [44]:
print(experience_required)

['0-2 Yrs', '3-7 Yrs', '2-7 Yrs', '3-7 Yrs', '3-6 Yrs', '1-2 Yrs', '2-5 Yrs', '2-7 Yrs', '3-8 Yrs', '0-5 Yrs', '0-1 Yrs', '3-8 Yrs', '2-6 Yrs', '2-4 Yrs', '3-7 Yrs', '2-6 Yrs', '3-7 Yrs', '2-3 Yrs', '3-7 Yrs']

In [48]:
Exp = experience_required[:10]  # Keep only the first 10 characters
print(Exp)

['0-2 Yrs', '3-7 Yrs', '2-7 Yrs', '3-7 Yrs', '3-6 Yrs', '1-2 Yrs', '2-5 Yrs', '2-7 Yrs', '3-8 Yrs', '0-5 Yrs']

In [49]:
Loc = job_location[:10]  # Keep only the first 10 characters
print(Loc)

['Gurugram', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Noida', 'Noida', 'Gurugram', 'Gurugram', 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru', 'Gurugram, Bengaluru', 'Gurugram', 'New Delhi']

In [51]:
Name=company_name[:10]
print(Name)

['Collegedunia', 'Monnai', 'Innovaccer', 'Tiketcom', 'Netomi', 'Birdeye Australia', 'Essenware', 'PayU', 'Varuna Integrated Logistics', 'Sociomix']

In [52]:
title=job_titles[:10]
print(title)

['Data Scientist', 'Data Scientist', 'Data Scientist', 'Data Scientist', 'Data Scientist - I', 'Data Scientist', 'Data Scientist', 'Data Scientist (Telco)', 'Data Analyst & Data Scientist', 'Data Scientist']

In [53]:
df = pd.DataFrame({
    'Title': title,
    'Location': Loc,
    'Company Name': Name,
    'Experience': Exp
})

In [54]:
df

,Title,Location,Company Name,Experience
0,Data Scientist,Gurugram,Collegedunia,0-2 Yrs
1,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Monnai,3-7 Yrs
2,Data Scientist,Noida,Innovaccer,2-7 Yrs
3,Data Scientist,Noida,Tiketcom,3-7 Yrs
4,Data Scientist - I,Gurugram,Netomi,3-6 Yrs
5,Data Scientist,Gurugram,Birdeye Australia,1-2 Yrs
6,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Essenware,2-5 Yrs
7,Data Scientist (Telco),"Gurugram, Bengaluru",PayU,2-7 Yrs
8,Data Analyst & Data Scientist,Gurugram,Varuna Integrated Logistics,3-8 Yrs
9,Data Scientist,New Delhi,Sociomix,0-5 Yrs

# Question No 2

In [57]:
driver = webdriver.Chrome()

In [59]:
driver.get("https://www.shine.com/")

In [80]:
search=driver.find_element(By.XPATH,"//span[@class='btn']")
search.click()

In [81]:
Job=driver.find_element(By.XPATH,"//div[@class='searchForm_search_main__Wc5x4']/ul/li[1]/div/input")
Job.send_keys('Data Analyst')

In [83]:
Location=driver.find_element(By.XPATH,"//div[@class='searchForm_search_main__Wc5x4']/ul/li[2]/div/input")
Location.send_keys('Bangalore')

In [86]:
search=driver.find_element(By.XPATH,"//div[@class='searchForm_btnWrap_advance__VYBHN']/button")
search.click()

In [148]:
job_titl=[]
job_Loca=[]
comp=[]
expr=[]

In [119]:
title_tags=driver.find_elements(By.CLASS_NAME,"jobCard_pReplaceH2__xWmHg")
for i in title_tags:
    title=i.text
    job_titl.append(title)

In [121]:
len(job_titl)

20

In [130]:
location_tags=driver.find_elements(By.XPATH,"//div[@class='jobCard_jobCard_lists__fdnsc']/div[1]")
for i in location_tags:
    location=i.text
    job_Loca.append(location)

In [132]:
len(job_Loca)

20

In [133]:
print(job_Loca)

['Bangalore\n+8', 'Bangalore\n+4', 'Bangalore\n+8', 'Bangalore\n+8', 'Bangalore\n+2', 'Bangalore\n+8', 'Bangalore\n+2', 'Bangalore', 'Bangalore\n+7', 'Bangalore', 'Bangalore\n+7', 'Bangalore\n+6', 'Bangalore', 'Bangalore', 'Bangalore\n+8', 'Bangalore\n+9', 'Bangalore\n+8', 'Bangalore\n+2', 'Bangalore\n+1', 'Bangalore\n+9']

In [149]:
company_tags=driver.find_elements(By.XPATH,"//div[@class='jobCard_jobCard_cName__mYnow']/span")
for i in company_tags:
    company=i.text
    comp.append(company)

In [150]:
len(comp)

20

In [151]:
comp

['appsoft solutions',
 'aryan technology',
 'gallagher and mohan private limited',
 'spento papers (india) llp',
 'diraa hr services hiring for diraa ...',
 'techno endura',
 'innovsource services private limite...',
 'white horse manpower consultancy (p...',
 'mackenzie modern it solutions priva...',
 'spurtree technologies private limit...',
 'techno endura',
 'techno endura',
 'ntech it solutions private limited',
 'metasearch recruitment services',
 'techno endura',
 'overnet trading private limited',
 'spento papers (india) llp',
 'diraa hr services hiring for diraa ...',
 'epergne solutions',
 'techno endura']

In [142]:
experience_tags=driver.find_elements(By.XPATH,"//div[@class='jobCard_jobCard_lists__fdnsc']/div[2]/div[1]")
for i in experience_tags:
    exp=i.text
    expr.append(exp)

In [143]:
len(expr)

20

In [144]:
expr

['0 to 4 Yrs',
 '0 to 4 Yrs',
 '2 to 7 Yrs',
 '8 to 13 Yrs',
 '0 to 4 Yrs',
 '0 to 2 Yrs',
 '1 to 4 Yrs',
 '5 to 8 Yrs',
 '5 to 8 Yrs',
 '5 to 10 Yrs',
 '0 to 4 Yrs',
 '0 to 2 Yrs',
 '8 to 13 Yrs',
 '3 to 8 Yrs',
 '0 to 2 Yrs',
 '0 to 4 Yrs',
 '12 to 22 Yrs',
 '0 to 4 Yrs',
 '6 to 12 Yrs',
 '0 to 4 Yrs']

In [125]:
J=job_titl[:10]
J

['Data Analyst , Senior Data Analyst , Data Analyst - Tec ...',
 'Data Analyst',
 'Senior Data Analyst',
 'Healthcare Data Analyst',
 'Urgent Hiring For Data Analyst',
 'Clinical Data Analyst Ii',
 'Operations Executive ( Data Analyst )',
 'Data Governance Analyst',
 'Data Science Analytics',
 'Business Analyst']

In [135]:
L=job_Loca[:10]
L

['Bangalore\n+8',
 'Bangalore\n+4',
 'Bangalore\n+8',
 'Bangalore\n+8',
 'Bangalore\n+2',
 'Bangalore\n+8',
 'Bangalore\n+2',
 'Bangalore',
 'Bangalore\n+7',
 'Bangalore']

In [146]:
E=expr[:10]
E

['0 to 4 Yrs',
 '0 to 4 Yrs',
 '2 to 7 Yrs',
 '8 to 13 Yrs',
 '0 to 4 Yrs',
 '0 to 2 Yrs',
 '1 to 4 Yrs',
 '5 to 8 Yrs',
 '5 to 8 Yrs',
 '5 to 10 Yrs']

In [153]:
C=comp[:10]
C

['appsoft solutions',
 'aryan technology',
 'gallagher and mohan private limited',
 'spento papers (india) llp',
 'diraa hr services hiring for diraa ...',
 'techno endura',
 'innovsource services private limite...',
 'white horse manpower consultancy (p...',
 'mackenzie modern it solutions priva...',
 'spurtree technologies private limit...']

In [154]:
df = pd.DataFrame({
    'Title': J,
    'Location': L,
    'Company Name': C,
    'Experience': E
})

In [155]:
df

,Title,Location,Company Name,Experience
0,"Data Analyst , Senior Data Analyst , Data Anal...",Bangalore\n+8,appsoft solutions,0 to 4 Yrs
1,Data Analyst,Bangalore\n+4,aryan technology,0 to 4 Yrs
2,Senior Data Analyst,Bangalore\n+8,gallagher and mohan private limited,2 to 7 Yrs
3,Healthcare Data Analyst,Bangalore\n+8,spento papers (india) llp,8 to 13 Yrs
4,Urgent Hiring For Data Analyst,Bangalore\n+2,diraa hr services hiring for diraa ...,0 to 4 Yrs
5,Clinical Data Analyst Ii,Bangalore\n+8,techno endura,0 to 2 Yrs
6,Operations Executive ( Data Analyst ),Bangalore\n+2,innovsource services private limite...,1 to 4 Yrs
7,Data Governance Analyst,Bangalore,white horse manpower consultancy (p...,5 to 8 Yrs
8,Data Science Analytics,Bangalore\n+7,mackenzie modern it solutions priva...,5 to 8 Yrs
9,Business Analyst,Bangalore,spurtree technologies private limit...,5 to 10 Yrs

# Flipkart Iphone 11 reviews

In [15]:
driver = webdriver.Chrome()

In [16]:
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART")

In [17]:
rate = []
revieww = []
reviews = []

In [18]:
for i in range(10):
    print('Scraping page:', i+1)
    Rati=driver.find_elements(By.XPATH,"//p[@class='z9E0IG']")
    for R in Rati:
        ra=R.text
        rate.append(ra)
    rev=driver.find_elements(By.XPATH,"//div[@class='XQDdHH Ga3i8K']")
    for e in rev:
        re=e.text
        revieww.append(re)
    full=driver.find_elements(By.XPATH,"//div[@class='ZmyHeo']/div/div")
    for l in full:
        fuu=l.text
        reviews.append(fuu)

    try:
        next_button = driver.find_element(By.XPATH,"//a[@class='_9QVEpD']")
        next_button.click()
        time.sleep(2)
    except:
        print("done ")
        break

Scraping page: 1
Scraping page: 2
Scraping page: 3
Scraping page: 4
Scraping page: 5
Scraping page: 6
Scraping page: 7
Scraping page: 8
Scraping page: 9
Scraping page: 10

In [19]:
df = pd.DataFrame({
    'Review': revieww,
    'Rating': rate,
    'Review summary': reviews
})

In [20]:
df

,Review,Rating,Review summary
0,5,Terrific,Very very good
1,5,Perfect product!,Photos super
2,5,Best in the market!,Good Camera
3,5,Classy product,Camera is awesome\nBest battery backup\nA perf...
4,5,Terrific purchase,Value for money üòç
...,...,...,...
95,5,Worth every penny,Feeling awesome after getting the delivery of ...
96,5,Wonderful,This is amazing at all
97,5,Must buy!,"Go for iPhone 11 , if confused between iPhone ..."
98,5,Just wow!,Perfect Product!!
99,5,Brilliant,Excellent Phone.

# Question 4

In [21]:
driver = webdriver.Chrome()

In [22]:
driver.get("https://www.flipkart.com")

In [26]:
Search=driver.find_element(By.XPATH,"//input[@class='Pke_EE']")
Search.send_keys('sneakers')

In [27]:
button=driver.find_element(By.XPATH,"//button[@class='_2iLD__']")
button.click()

In [44]:
Brands = []
ProductDescriptions = []
Prices = []

In [45]:
for i in range(3):
    print('Scraping page:', i+1)
    brand=driver.find_elements(By.XPATH,"//div[@class='syl9yP']")
    for B in brand:
        br=B.text
        Brands.append(br)
    describe=driver.find_elements(By.XPATH,"//div[@class='hCKiGj']/a[1]")
    for P in describe:
        Pr=P.text
        ProductDescriptions.append(Pr)
    rate=driver.find_elements(By.XPATH,"//div[@class='hCKiGj']/a[2]")
    for R in rate:
        fuu=R.text
        Prices.append(fuu)

    try:
        next_button = driver.find_element(By.XPATH,"//a[@class='_9QVEpD']")
        next_button.click()
        time.sleep(2)
    except:
        print("done ")
        break

Scraping page: 1
Scraping page: 2
Scraping page: 3

In [46]:
len(Brands)

120

In [47]:
len(ProductDescriptions)

120

In [48]:
len(Prices)

120

In [49]:
Brand=Brands[:100]
len(Brand)

100

In [50]:
ProductDescription=ProductDescriptions[:100]
len(ProductDescription)

100

In [52]:
Price=Prices[:100]
len(Price)

100

In [53]:
df = pd.DataFrame({
    'Brand': Brand,
    'ProductDescription': ProductDescription,
    'Rate': Price
})

In [54]:
df

,Brand,ProductDescription,Rate
0,aadi,Sneakers For Men,"‚Çπ453‚Çπ1,99977% off\nFree delivery"
1,Shozie,Stylish Walking Partywear Sneakers Casual Shoe...,‚Çπ449‚Çπ99955% off\nFree delivery
2,PUMA,Puma Propelix Sneakers For Men,"‚Çπ2,339‚Çπ4,49948% off\nFree delivery"
3,KILLER,Killer Men Grey Faux Leather Casual Lace Up Sn...,"‚Çπ1,199‚Çπ3,99569% off\nFree delivery"
4,CAMPUS,OG-D3 Sneakers For Men,"‚Çπ657‚Çπ1,39953% off\nFree delivery"
...,...,...,...
95,PUMA,Puma Rungryp Sneakers For Men,"‚Çπ2,350‚Çπ4,99952% off\nFree delivery"
96,Roadster,Casual Shoes Sneakers For Men,"‚Çπ1,349‚Çπ3,29959% off\nFree delivery"
97,HRX by Hrithik Roshan,CITY ESCAPE Sneakers For Men,"‚Çπ980‚Çπ3,49971% off\nFree delivery"
98,Red Tape,Casual Sneaker Shoes for Men | Elegantly Round...,"‚Çπ1,769‚Çπ5,89970% off\nFree delivery"
99,Red Tape,"Casual Shoes| Soft Cushioned Insole, Slip-Resi...","‚Çπ1,769‚Çπ5,89970% off\nFree delivery"

# Question 5

In [79]:
driver = webdriver.Chrome()

In [80]:
driver.get("https://www.amazon.in/")

In [81]:
Search=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
Search.send_keys('Laptop')

In [82]:
button=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input")
button.click()

In [85]:
button=driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/span/div/div/div[5]/ul[2]/span/span[9]/li/span/a/div")
button.click()

In [86]:
NAME=[]
RATING=[]
PRICE=[]

In [87]:
name=driver.find_elements(By.XPATH,"//span[@class='a-size-medium a-color-base a-text-normal']")
for i in name:
    jk=i.text
    NAME.append(jk)
NAME=NAME[:10]

rating=driver.find_elements(By.XPATH,"//span[@class='a-size-base s-underline-text']")
for i in rating:
    kj=i.text
    RATING.append(kj)
RATING=RATING[:10]

price=driver.find_elements(By.XPATH,"//span[@class='a-price-whole']")
for m in price:
    sd=m.text
    PRICE.append(sd)
PRICE=PRICE[:10]

In [88]:
df = pd.DataFrame({
    'Laptop name ': NAME,
    'Ratings': RATING,
    'price': PRICE
})

In [89]:
df

                                        Laptop name  Ratings     price
0  Dell Inspiorn 5630 Laptop, Intel 13th Gen i7-1...       1    91,744
1  Acer Aspire Lite 12th Gen Intel Core i7-1255U ...     488    52,980
2  ASUS Vivobook 15, 15.6" (39.62cm) FHD, Intel C...      20    61,990
3  NSXEEN Portable Laptop Stand, Aluminum Adjusta...     286       449
4  HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...      70    66,490
5  Acer Nitro V Gaming Laptop 13th Gen Intel Core...       3    87,990
6  MSI Thin 15, Intel 13th Gen. Core i7-13620H, 4...       2    69,990
7  (Refurbished) Dell Latitude 7480 14in FHD Lapt...     738    27,845
8  Dell [Smartchoice] G15 5530 Gaming Laptop, Int...      11  1,00,090
9  Dell Inspiron 3530 Laptop, 13th Generation Int...       8    69,990

# QUESTION 6

In [5]:
driver = webdriver.Chrome()

In [6]:
driver.get("https://www.azquotes.com/")

In [7]:
button=driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a")
button.click()

In [8]:
Quote = []
Author = []
Type = []

In [9]:
for i in range(10):
    print('Scraping page:', i+1)
    quote=driver.find_elements(By.XPATH,"//div[@class='wrap-block']/p/a[2]")
    for a in quote:
        te=a.text
        Quote.append(te)
    Aname=driver.find_elements(By.XPATH,"//div[@class='wrap-block']/div/a")
    for P in Aname:
        Pr=P.text
        Author.append(Pr)
    types=driver.find_elements(By.XPATH,"//div[@class='wrap-block']/div[2]/div[1]/a[1]")
    for R in types:
        fuu=R.text
        Type.append(fuu)

    try:
        next_button = driver.find_element(By.XPATH,"//li[@class='next']")
        next_button.click()
        time.sleep(2)
    except:
        print("done ")
        break

Scraping page: 1
Scraping page: 2
Scraping page: 3
Scraping page: 4
Scraping page: 5
Scraping page: 6
Scraping page: 7
Scraping page: 8
Scraping page: 9
Scraping page: 10
done

In [10]:
df = pd.DataFrame({
    'Quote': Quote,
    'Author_Name': Author,
    'Type Of Quotes': Type
})

In [11]:
df

,Quote,Author_Name,Type Of Quotes
0,The essence of strategy is choosing what not t...,Michael Porter,Essence
1,One cannot and must not try to erase the past ...,Golda Meir,Inspiration
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,Country
3,Death is something inevitable. When a man has ...,Nelson Mandela,Inspirational
4,You have to love a nation that celebrates its ...,Erma Bombeck,4th Of July
...,...,...,...
995,Regret for the things we did can be tempered b...,Sydney J. Harris,Love
996,America... just a nation of two hundred millio...,Hunter S. Thompson,Gun
997,For every disciplined effort there is a multip...,Jim Rohn,Inspirational
998,"The spiritual journey is individual, highly pe...",Ram Dass,Spiritual
999,The mind is not a vessel to be filled but a fi...,Plutarch,Inspirational

# Question No.7

In [12]:
driver = webdriver.Chrome()

In [13]:
driver.get("https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1")

In [63]:
name = []
age = [] 
terms = []
ending = []
Remark = []

In [62]:
Remark.clear()

In [64]:
named=driver.find_elements(By.XPATH,"//tbody/tr/td[2]")
for i in named:
    tf=i.text
    name.append(tf)
name=name[1:-1]


DOB=driver.find_elements(By.XPATH,"//tbody/tr/td[3]")
for f in DOB:
    df=f.text
    age.append(df)
age=age[1:]


Term=driver.find_elements(By.XPATH,"//tbody/tr/td[4]")
for h in Term:
    gh=h.text
    terms.append(gh)
terms=terms[1:]

end=driver.find_elements(By.XPATH,"//tbody/tr/td[5]")
for t in end:
    hg=t.text
    ending.append(hg)
ending=ending[1:]

remar=driver.find_elements(By.XPATH,"//tbody/tr/td[6]")
for i in remar:
    f=i.text
    Remark.append(f)

In [55]:
len(Remark)

18

In [56]:
len(ending)

18

In [57]:
len(name)

58

In [47]:
len(Age)

0

In [39]:
len(Terms)

19

In [40]:
Terms=Terms[1:]

In [46]:
len(Terms)

18

In [65]:
df = pd.DataFrame({
    'Name': name,
    'Age': age,
    'term_of_office_start': terms,
    'term_of_office_End': ending,
    'Duration_remarks': Remark
})

In [66]:
df

,Name,Age,term_of_office_start,term_of_office_End,Duration_remarks
0,Jawaharlal Nehru,"57 years, 274 days",15 August1947,27 May 1964,"16 years, 286 days"
1,Gulzarilal Nanda,"65 years, 328 days",27 May 1964,9 June 1964,13 days
2,Lal Bahadur Shastri,"62 years, 250 days",9 June 1964,11 January 1966,"1 year, 216 days"
3,Gulzarilal Nanda,"67 years, 191 days",11 January 1966,24 January 1966,13 days
4,Indira Gandhi,"48 years, 66 days",24 January 1966,24 March 1977,"11 years, 59 days"
5,Morarji Desai,"81 years, 24 days",24 March 1977,28 July 1979,"2 years, 126 days"
6,Charan Singh,"76 years, 217 days",28 July 1979,14 January 1980,170 days
7,Indira Gandhi,"62 years, 56 days",14 January 1980,31 October 1984,"4 years, 291 days"
8,Rajiv Gandhi,"40 years, 72 days",31 October 1984,2 December 1989,"5 years, 32 days"
9,Vishwanath Pratap Singh,"58 years, 160 days",2 December 1989,10 November 1990,343 days
10,Chandra Shekhar,"63 years, 207 days",10 November 1990,21 June 1991,223 days
11,P. V. Narasimha Rao,"69 years, 358 days",21 June 1991,16 May 1996,"4 years, 330 days"
12,Atal Bihari Vajpayee,"71 years, 143 days",16 May 1996,1 June 1996,16 days
13,H. D. Deve Gowda,"63 years, 14 days",1 June 1996,21 April 1997,324 days
14,Inder Kumar Gujral,"77 years, 138 days",21 April 1997,19 March 1998,332 days
15,Atal Bihari Vajpayee,"73 years, 84 days",19 March 1998,22 May 2004,"6 years, 64 days"
16,Manmohan Singh,"71 years, 239 days",22 May 2004,26 May 2014,"10 years, 4 days"
17,Narendra Modi,"63 years, 251 days",26 May 2014,Incumbent,"10 years, 87 days"

# Question No. 8

In [67]:
driver = webdriver.Chrome()

In [68]:
driver.get("https://www.motor1.com/")

In [69]:
Search=driver.find_element(By.XPATH,"/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/input")
Search.send_keys('50 most expensive cars')

In [71]:
button=driver.find_element(By.XPATH,"/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/button[1]")
button.click()

In [72]:
button=driver.find_element(By.XPATH,"/html/body/div[9]/div[9]/div/div[1]/div/div/div[1]/div/div[1]/h3/a")
button.click()

In [73]:
name=[]
price=[]

In [74]:
car=driver.find_elements(By.XPATH,"//h3[@class='subheader']")
for i in car:
    rt=i.text
    name.append(rt)
name=name[:-1]

pp=driver.find_elements(By.XPATH,"//strong")
for j in pp:
    tt=j.text
    price.append(tt)

In [75]:
len(name)

50

In [76]:
len(price)

50

In [77]:
df = pd.DataFrame({
    'Car_Name': name,
    'Price': price,
})

In [78]:
df

                                     Car_Name                        Price
0                           McLaren Senna GTR                 $1.7 Million
1                                 Czinger 21C          Price: $1.7 Million
2                               Ferrari Monza          Price: $1.7 Million
3                          Gordon Murray T.33          Price: $1.7 Million
4                           Koenigsegg Gemera          Price: $1.7 Million
5                          Hennessey Venom F5          Price: $1.8 Million
6                             Bentley Bacalar          Price: $1.9 Million
7               Hispano Suiza Carmen Boulogne          Price: $1.9 Million
8                      Bentley Mulliner Batur          Price: $2.0 Million
9                                 SSC Tuatara          Price: $2.0 Million
10                                Lotus Evija          Price: $2.1 Million
11                        Aston Martin Vulcan          Price: $2.3 Million
12                                 Delage D12          Price: $2.3 Million
13                        Ferrari Daytona SP3          Price: $2.3 Million
14                          McLaren Speedtail          Price: $2.3 Million
15                               Rimac Nevera          Price: $2.4 Million
16                              Pagani Utopia          Price: $2.5 Million
17                       Pininfarina Battista          Price: $2.5 Million
18                         Gordon Murray T.50          Price: $2.6 Million
19                       Lamborghini Countach          Price: $2.6 Million
20              Hennessey Venom F5 Revolution                 $2.7 Million
21                   Mercedes-AMG Project One          Price: $2.7 Million
22                               Zenvo Aurora          Price: $2.8 Million
23                        Aston Martin Victor          Price: $3.0 Million
24                Hennessey Venom F5 Roadster                 $3.0 Million
25                           Koenigsegg Jesko          Price: $3.0 Million
26                                 Aspark Owl                 $3.1 Million
27                      Aston Martin Valkyrie          Price: $3.2 Million
28                  W Motors Lykan Hypersport          Price: $3.4 Million
29                              McLaren Solus                 $3.5 Million
30                        Pagani Huayra Evo R          $3.5 Million (est.)
31                           Lamborghini Sian          Price: $3.6 million
32                           Koenigsegg CC850          Price: $3.7 Million
33            Bugatti Chiron Super Sport 300+          Price: $3.9 Million
34  Gordon Murray Automotive T.50s Niki Lauda                 $3.9 Million
35                  Pagani Huayra Roadster BC                 $4.0 Million
36                         Lamborghini Veneno          Price: $4.5 Million
37                             Bugatti Bolide          Price: $4.7 Million
38                  Pininfarina B95 Speedster          Price: $4.8 Million
39                            Bugatti Mistral          Price: $5.0 Million
40                               Bugatti Divo          Price: $5.8 Million
41                        Pagani Huayra Imola                 $6.0 Million
42                           Pagani Codalunga          Price: $7.4 Million
43                   Mercedes-Maybach Exelero          Price: $8.0 Million
44                         Bugatti Centodieci          Price: $9.0 Million
45                    Bugatti Chiron Profil√©e         Price: $10.8 Million
46                       Rolls-Royce Sweptail         Price: $12.8 Million
47                   Bugatti La Voiture Noire         Price: $13.4 Million
48                      Rolls-Royce Boat Tail  Price: $28.0 Million (est.)
49         Rolls-Royce La Rose Noire Droptail    Price: $30 Million (est.)